package chap08.schap02


fun main() {

}

fun c3(){
    /*
    *   봉인된 클래스 sealed
    *
    *   어떤 클래스를 sealed로 지정하면, 이 클래스를 상속하는 클래스는 내포된 클래스 또는 객체로 정의되거나 같은 파일 안에서 최상위 클래스로 정의돼야만 한다.
    *   코틀린 1.5부터는 같은 컴파일 단위 안의 같은 패키지에 있는 봉인된 클래스나 인터페이스를 상속할 수 있게 됐다.
    *   이러한 영역 밖에서 봉인된 클래스는 final 클래스와 동일한 효과를 지니며, 아무도 봉인된 클래스를 상속할 수 없다.
    *   봉인된 클래스는 직접 인스턴스를 만들 수 없으므로 추상 클래스이기도 하다는 점에 유의하자.
    *   봉인된 클래스의 인스턴스를 만들 때는 봉인된 클래스의 하위 클래스 중 하나를 선택해 만들어야 한다.
    *   sealed 변경자를 인터페이스에 적용할 수 없다.
    *
    *
    * */


}